#+TITLE: Emacs workshop 2022: Day 4
#+DATE: <2022-01-27 Thu>
#+AUTHOR: Maikol Solís
#+options: H:3 title:nil toc:nil


**** =org-roam-bibtex=
#+begin_src elisp
(after! citar
(setq org-cite-global-bibliography '("~/documents/2022/2022_01_Taller_Emacs/Day_4/roam/library.bib")))
#+end_src

#+RESULTS:
| ~/documents/2022/2022_01_Taller_Emacs/Day_4/roam/library.bib |


#+begin_src elisp
(use-package! org-roam-bibtex
  :after org-roam
  :config
  (setq orb-preformat-keywords
        '("citekey" "title" "url" "author-or-editor" "keywords" "file"))

  (setq orb-process-file-keyword t
        orb-file-field-extensions '(".pdf", ".djvu")))
#+end_src

